# Задание 4.
# Запросите у пользователя значения выручки и издержек фирмы. Определите, с каким финансовым результатом работает фирма
# (прибыль — выручка больше издержек, или убыток — издержки больше выручки).Выведите соответствующее сообщение. Если
# фирма отработала с прибылью,вычислите рентабельность выручки (соотношение прибыли к выручке). Далее запросите
# численность сотрудников фирмы и определите прибыль фирмы в расчете на одного сотрудника.

revenue = int(input("Введите выручку фирмы: "))
costs = int(input("Введите издержки фирмы:"))
if revenue > costs:
    profit = revenue - costs
    print(f"Финансовый результат - прибыль. Ее величина: {profit}")
    print(f"Рентабельность выручки = {profit / revenue}")
    number_staff = int(input("Введите численность сотрудников фирмы: "))
    print(f"Прибыль фирмы в расчете на одного сотрудника {profit / number_staff}")
else:
    print(f"Финансовый результат - убыток. Его величина: {costs - revenue}")
